[{"time":"14:00-14:20","type":"Breakout","title":"The story of a power measurement board and release of Node-RED node.","abstract":"will talk about my experiences about planning of the commercial magazine appendices, manufacturing the board, developing and releasing the Node-RED node.\nFor this project, I made a power measurement expansion board used with Raspberry Pi and Jetson Nano.\nIn the magazine, I explained how to control the board with Python language, but since the specification is with generic I2C protocol, I developed the Node-RED node to control the board easier.\nI hope that Node-RED will be an option for development and prototyping using edge devices such as Raspberry Pi and Jetson Nano, and many similar cases will be realized in the future.","speaker":"Kitazaki Ayachika","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/ayachika.png","company":"nora hack team"},{"time":"14:30-14:50","type":"Breakout","title":"Application of Node-RED to Art and Interactive Works","abstract":"I found out about Node-RED in August of this year, and since I was interested in it, I have been working on an online interaction project called \"Tsunagu, Fireworks\" since the 28th of the same month. (at the time of writing, it is in final preparation).  As people are asked to refrain from going out unnecessarily, I created this work based on the concept of fireworks that can be set off by each participant as content that can be enjoyed at home. In this work, you can set off your own fireworks through LINE.　 In addition, the color and time of the fireworks are stored on the server, and the fireworks that are set off once will be set off again an hour later or the next day.　In this way, as the days go by, the night sky will be filled with the fireworks of each and every person.  In the session, I would like to present the flow of data and the production process, and introduce it as one of the application examples.","speaker":"Otomo Shogo","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/shogo.jpg","company":"Nihon University Collage of Arts Department of music Information music course"},{"time":"15:00-15:20","type":"Breakout","title":"In-Process Clinical Intelligence: Node-RED + Medical Logic = Whole Hospital IoTnization","abstract":"Currently, there are more than 50 types of medical information servers used in medical practice in general hospitals. It is becoming increasingly difficult to see the full picture of the process in a medical practice that is advancing, specializing, and fragmenting every day. Node-RED, a flow programming, prototype-based, object-oriented, and ECMAScript-based architecture, is a great way to describe the \"medical logic\" in an aggregated manner and implement hospital medical workflows with various branches. Node-RED architecture is fully compatible with HL7 and FHIR, the next generation of healthcare information standards, and is an excellent core control for IoT equipment. In this session, we will discuss In-Process Clinical Intelligence (IPCI) concept.This presentation will introduce proposals and initiatives for the next generation of medical IoT to achieve one of the major goals of medical informatics, \"primary use of medical practice big data\" and \"perpetuation of medical logic,\" which can be achieved by overcoming the computational explosion and super-heavy data.","speaker":"Kota Torikai","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/kota.jpg","company":"Gunma University Hospital, Japan"},{"time":"15:30-15:50","type":"Breakout","title":"Node-RED from the point of view of a Java developer","abstract":"We are developing CONNEXIVE IoT Connectivity Engine (ICE), an IoT platform product that uses Node-RED.\nMost of ICE developers are originally Java middleware developers.\nWe will introduce know-how such as difficult points when using Node-RED from the view of Java developers.","speaker":"Keisuke Kajigaya / Koki Yasumoto","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/keisuke.jpg","company":"NEC Corporation"},{"time":"16:00-16:20","type":"Breakout","title":"Activities Using Node-RED for CivicTech Improvement","abstract":"Local governments throughout Japan have been applying IoT themes to revitalize their regions. \n\nUhuru has introduced Node-RED, which allows a variety of systems to be implemented using non-coding / low-coding environment to these efforts, and even participants who have no programming experience are easily able to start applying their ideas to improve these efforts.\n\nIn this session, we would like to present how Node-RED is contributing to CivicTech improvement, by bringing in actual examples of the results of our efforts to demonstrate Node-RED’s considerable value.","speaker":"Mitsuhiro Shoji","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/mitsuhiro.png","company":"Uhuru Corporation"},{"time":"16:30-16:50","type":"Breakout","title":"The key to solving problems by citizen developers, and the best development tool for them, Node-RED","abstract":"\"Citizen developer\" is a hot topic these days, and the definition seems to vary depending on the case.  One is a developer who works on a pro bono basis to solve local problems, etc.  The other is a business person who develops software to solve business problems by himself/herself without outsourcing to a professional developer (or a development company).  Node-RED can be an effective tool for this situation.    In this session, I will share the \"keys to solving problems\" and how to do it, based on my experience of running a user community of Node-RED based tools for 3.5 years and interacting with various users.","speaker":"Wataru Yamazaki","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/wataru.jpg","company":"Uhuru Corporation"}]