[{"time":"14:00-14:20","type":"Breakout","title":"How to achieve DX of lighting equipment with the combination of DALI-KNX-Node-RED","abstract":"Everyone, please look up. Do you see any lighting fixtures? Lighting\nis set up in all kinds of spaces such as homes, offices, factories,\nand public facilities.\nAnd these lighting fixtures have a great impact on our vision.\n\nThere are not only psychological aspects such as stress and comfort,\nbut also marketing aspects that can lead to purchasing behavior if it\nis a store.\n\nIn this session, I will explain how to use Node-RED in combination\nwith open facility control protocols called DALI and KNX to \"get the\nlighting status\" and \"control lighting using external APIs,\" which are\nkey to DX.","speaker":"Takahiro Nakahata","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/takahiro.jpg","company":"SmartLight Co.,Ltd."},{"time":"14:30-14:50","type":"Breakout","title":"Factory IoT/DX with Node-RED Custom Nodes","abstract":"Node-RED is being used in many IoT solutions because it allows you to quickly build IoT applications. The ia-cloud project at the Industrial Automation Forum (IAF) is also using Node-RED to create an environment for developing IoT applications that can be used in the manufacturing industry.\n\nHowever, many of you may have experienced that it is difficult to find a node to connect sensors and measurement control devices used in factories, even if you look for one from the more than 3000 nodes available on the Node-RED website.\n\nThis is why the ia-cloud project is working with device manufacturers and system integrators to increase the number of custom Node-RED nodes for devices you want to connect.\n\nIn this session, I will introduce the efforts of the ia-cloud project. Furthermore, I will talk about the ecosystem around Node-RED nodes by enebular.\n","speaker":"Takao Aoki","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/takao.jpg","company":"Uhuru Corporation"},{"time":"15:00-15:20","type":"Breakout","title":"Node-RED supports a “DIY” type of manufacturing IoT utilizing industrial sensors and controllers.","abstract":"We, IAF(Industrial Automation Forum) , defined REST/JSON, Websocket/JSON APIs and industrial IoT data object formats for a manufacturing industry.\nFor IoT of manufacturing, a DIY type of application development environment would be essential.\nNode-RED custom nodes used for connecting industrial sensors and controllers ,like 4-20mA remote-IOs and PLCs so forth, are released by IAF.\nWe will make a presentation on usage of these ia-cloud Node-RED nodes and a actual users voce.","speaker":"Hiroaki Hashimukai","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/hiroaki.jpg","company":"IAF(Industry Automation Forum),"},{"time":"15:30-15:50","type":"Breakout","title":"The current situation of manufacturing facilities and the concept of Local IoT Server.","abstract":"Manufacturing companies are interested in digitalization, but digitalization has not progressed much. We advocate a \"Local IoT Server\" as a digitization tool that can be handled by non-information engineers in manufacturing sites, and recommend implementation using Node-RED. We are working to encourage the use of digital technology through system prototyping and onsite practice.　","speaker":"Heima Hayashida","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/heima.jpg","company":"Nara Prefecture Institute of Industrial Development"},{"time":"16:00-16:20","type":"Breakout","title":"Hitachi Data Hub and How Hitachi Leverage Node-RED","abstract":"Hitachi has been promoting Lumada to help customers accelerate their digital innovation through co-creation effort, that is creating values from their data. To accelerate creating values from data, we are offering “Hitachi Data Hub” that provides data collecting/refining/storing/visualizing features as one package. we leverage Node-RED for Hitachi Data Hub to provide a feature that is designing data flows without programming work. In this session, We will give backgrounds and details of this.","speaker":"Daisuke Ito","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/daisuke.jpg","company":"Hitachi, Ltd."},{"time":"16:30-16:50","type":"Breakout","title":"EnOcean Wireless Sensor Node Development Case Study","abstract":"The \"ia-cloud\" project of the Industrial Automation Forum (IAF) is working towards the spread and realization of IoT in manufacturing sites.\n\nWith the realization of the IoT in the manufacturing field, we can expect to convert various events into data, including the monitoring of equipment and operating conditions.\nIn such cases, when information that cannot be obtained from existing equipment is needed, it is necessary to introduce new edge sensors for IoT.\n\nIn this session, we will discuss how to use the EnOcean sensor, an edge sensor that uses energy harvesting wireless technology to operate without batteries.\nAnd also we will introduce data collection methods using EnOcean sensors, along with the inside story of EnOcean custom node development.","speaker":"Yamada Jumpei","photo":"https://nodered.jp/noderedcon2021/assets/img/speaker/jumpei.jpg","company":"K.T.System Co., Ltd."}]